MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1578/mcu.h
extern volatile PWM1CLKCONbits_t PWM1CLKCONbits __at(0xD9E);
// bitfield macros
#define _PWM1CLKCON_CS_POSN                                 0x0
#define _PWM1CLKCON_CS_POSITION                             0x0
#define _PWM1CLKCON_CS_SIZE                                 0x2
#define _PWM1CLKCON_CS_LENGTH                               0x2
#define _PWM1CLKCON_CS_MASK                                 0x3
#define _PWM1CLKCON_PS_POSN                                 0x4
#define _PWM1CLKCON_PS_POSITION                             0x4
#define _PWM1CLKCON_PS_SIZE                                 0x3
#define _PWM1CLKCON_PS_LENGTH                               0x3
#define _PWM1CLKCON_PS_MASK                                 0x70
#define _PWM1CLKCON_PWM1CS0_POSN                            0x0
#define _PWM1CLKCON_PWM1CS0_POSITION                        0x0
#define _PWM1CLKCON_PWM1CS0_SIZE                            0x1
#define _PWM1CLKCON_PWM1CS0_LENGTH                          0x1
#define _PWM1CLKCON_PWM1CS0_MASK                            0x1
#define _PWM1CLKCON_PWM1CS1_POSN                            0x1
#define _PWM1CLKCON_PWM1CS1_POSITION                        0x1
#define _PWM1CLKCON_PWM1CS1_SIZE                            0x1
#define _PWM1CLKCON_PWM1CS1_LENGTH                          0x1
#define _PWM1CLKCON_PWM1CS1_MASK                            0x2
#define _PWM1CLKCON_PWM1PS0_POSN                            0x4
#define _PWM1CLKCON_PWM1PS0_POSITION                        0x4
#define _PWM1CLKCON_PWM1PS0_SIZE                            0x1
#define _PWM1CLKCON_PWM1PS0_LENGTH                          0x1
#define _PWM1CLKCON_PWM1PS0_MASK                            0x10
#define _PWM1CLKCON_PWM1PS1_POSN                            0x5
#define _PWM1CLKCON_PWM1PS1_POSITION                        0x5
#define _PWM1CLKCON_PWM1PS1_SIZE                            0x1
#define _PWM1CLKCON_PWM1PS1_LENGTH                          0x1
#define _PWM1CLKCON_PWM1PS1_MASK                            0x20
#define _PWM1CLKCON_PWM1PS2_POSN                            0x6
#define _PWM1CLKCON_PWM1PS2_POSITION                        0x6
#define _PWM1CLKCON_PWM1PS2_SIZE                            0x1
#define _PWM1CLKCON_PWM1PS2_LENGTH                          0x1
#define _PWM1CLKCON_PWM1PS2_MASK                            0x40
#define _PWM1CLKCON_PWM1CS_POSN                             0x0
#define _PWM1CLKCON_PWM1CS_POSITION                         0x0
#define _PWM1CLKCON_PWM1CS_SIZE                             0x3
#define _PWM1CLKCON_PWM1CS_LENGTH                           0x3
#define _PWM1CLKCON_PWM1CS_MASK                             0x7
#define _PWM1CLKCON_PWM1PS_POSN                             0x4
#define _PWM1CLKCON_PWM1PS_POSITION                         0x4
#define _PWM1CLKCON_PWM1PS_SIZE                             0x3
#define _PWM1CLKCON_PWM1PS_LENGTH                           0x3
#define _PWM1CLKCON_PWM1PS_MASK                             0x70
#define _PWM1CLKCON_CS0_POSN                                0x0
#define _PWM1CLKCON_CS0_POSITION                            0x0
#define _PWM1CLKCON_CS0_SIZE                                0x1
#define _PWM1CLKCON_CS0_LENGTH                              0x1
#define _PWM1CLKCON_CS0_MASK                                0x1
#define _PWM1CLKCON_CS1_POSN                                0x1
#define _PWM1CLKCON_CS1_POSITION                            0x1
#define _PWM1CLKCON_CS1_SIZE                                0x1
#define _PWM1CLKCON_CS1_LENGTH                              0x1
#define _PWM1CLKCON_CS1_MASK                                0x2
#define _PWM1CLKCON_PS0_POSN                                0x4
#define _PWM1CLKCON_PS0_POSITION                            0x4
#define _PWM1CLKCON_PS0_SIZE                                0x1
#define _PWM1CLKCON_PS0_LENGTH                              0x1
#define _PWM1CLKCON_PS0_MASK                                0x10
#define _PWM1CLKCON_PS1_POSN                                0x5
#define _PWM1CLKCON_PS1_POSITION                            0x5
#define _PWM1CLKCON_PS1_SIZE                                0x1
#define _PWM1CLKCON_PS1_LENGTH                              0x1
#define _PWM1CLKCON_PS1_MASK                                0x20
#define _PWM1CLKCON_PS2_POSN                                0x6
#define _PWM1CLKCON_PS2_POSITION                            0x6
#define _PWM1CLKCON_PS2_SIZE                                0x1
#define _PWM1CLKCON_PS2_LENGTH                              0x1
#define _PWM1CLKCON_PS2_MASK                                0x40

// Register: PWM1LDCON
#define PWM1LDCON PWM1LDCON
extern volatile unsigned char           PWM1LDCON           __at(0xD9F);
#ifndef _LIB_BUILD
asm("PWM1LDCON equ 0D9Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LDS                    :2;
        unsigned                        :4;
        unsigned LDT                    :1;
        unsigned LDA                    :1;
    };
    struct {
        unsigned PWM1LDS0               :1;
        unsigned PWM1LDS1               :1;
    };
    struct {
        unsigned PWM1LDS                :2;
        unsigned                        :4;
        unsigned PWM1LDM                :1;
        unsigned PWM1LD                 :1;
    };
    struct {
        unsigned LDS0                   :1;
        unsigned LDS1                   :1;
    };
} PWM1LDCONbits_t;
extern volatile PWM1LDCONbits_t PWM1LDCONbits __at(0xD9F);
// bitfield macros
#define _PWM1LDCON_LDS_POSN                                 0x0
#define _PWM1LDCON_LDS_POSITION                             0x0
#define _PWM1LDCON_LDS_SIZE                                 0x2
#define _PWM1LDCON_LDS_LENGTH                               0x2
#define _PWM1LDCON_LDS_MASK                                 0x3
#define _PWM1LDCON_LDT_POSN                                 0x6
#define _PWM1LDCON_LDT_POSITION                             0x6
#define _PWM1LDCON_LDT_SIZE                                 0x1
#define _PWM1LDCON_LDT_LENGTH                               0x1
#define _PWM1LDCON_LDT_MASK                                 0x40
#define _PWM1LDCON_LDA_POSN                                 0x7
#define _PWM1LDCON_LDA_POSITION                             0x7
#define _PWM1LDCON_LDA_SIZE                                 0x1
#define _PWM1LDCON_LDA_LENGTH                               0x1
#define _PWM1LDCON_LDA_MASK                                 0x80
#define _PWM1LDCON_PWM1LDS0_POSN                            0x0
#define _PWM1LDCON_PWM1LDS0_POSITION                        0x0
#define _PWM1LDCON_PWM1LDS0_SIZE                            0x1
#define _PWM1LDCON_PWM1LDS0_LENGTH                          0x1
#define _PWM1LDCON_PWM1LDS0_MASK                            0x1
#define _PWM1LDCON_PWM1LDS1_POSN                            0x1
#define _PWM1LDCON_PWM1LDS1_POSITION                        0x1
#define _PWM1LDCON_PWM1LDS1_SIZE                            0x1
#define _PWM1LDCON_PWM1LDS1_LENGTH                          0x1
#define _PWM1LDCON_PWM1LDS1_MASK                            0x2
#define _PWM1LDCON_PWM1LDS_POSN                             0x0
#define _PWM1LDCON_PWM1LDS_POSITION                         0x0
#define _PWM1LDCON_PWM1LDS_SIZE                             0x2
#define _PWM1LDCON_PWM1LDS_LENGTH                           0x2
#define _PWM1LDCON_PWM1LDS_MASK                             0x3
#define _PWM1LDCON_PWM1LDM_POSN                             0x6
#define _PWM1LDCON_PWM1LDM_POSITION                         0x6
#define _PWM1LDCON_PWM1LDM_SIZE                             0x1
#define _PWM1LDCON_PWM1LDM_LENGTH                           0x1
#define _PWM1LDCON_PWM1LDM_MASK                             0x40
#define _PWM1LDCON_PWM1LD_POSN                              0x7
#define _PWM1LDCON_PWM1LD_POSITION                          0x7
#define _PWM1LDCON_PWM1LD_SIZE                              0x1
#define _PWM1LDCON_PWM1LD_LENGTH                            0x1
#define _PWM1LDCON_PWM1LD_MASK                              0x80
#define _PWM1LDCON_LDS0_POSN                                0x0
#define _PWM1LDCON_LDS0_POSITION                            0x0
#define _PWM1LDCON_LDS0_SIZE                                0x1
#define _PWM1LDCON_LDS0_LENGTH                              0x1
#define _PWM1LDCON_LDS0_MASK                                0x1
#define _PWM1LDCON_LDS1_POSN                                0x1
#define _PWM1LDCON_LDS1_POSITION                            0x1
#define _PWM1LDCON_LDS1_SIZE                                0x1
#define _PWM1LDCON_LDS1_LENGTH                              0x1
#define _PWM1LDCON_LDS1_MASK                                0x2

// Register: PWM1OFCON
#define PWM1OFCON PWM1OFCON
extern volatile unsigned char           PWM1OFCON           __at(0xDA0);
#ifndef _LIB_BUILD
asm("PWM1OFCON equ 0DA0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OFS                    :2;
        unsigned                        :2;
        unsigned OFO                    :1;
        unsigned OFM                    :2;
    };
    struct {
        unsigned PWM1OFS0               :1;
        unsigned PWM1OFS1               :1;
        unsigned                        :3;
        unsigned PWM1OFM0               :1;
        unsigned PWM1OFM1               :1;
    };
    struct {
        unsigned PWM1OFS                :2;
        unsigned                        :2;
        unsigned PWM1OFMC               :1;
        unsigned PWM1OFM                :2;
    };
    struct {
        unsigned OFS0                   :1;
        unsigned OFS1                   :1;
        unsigned                        :3;
        unsigned OFM0                   :1;
        unsigned OFM1                   :1;
    };
} PWM1OFCONbits_t;
