MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1578/mcu.h
// Register: PWM2OFCON
#define PWM2OFCON PWM2OFCON
extern volatile unsigned char           PWM2OFCON           __at(0xDB0);
#ifndef _LIB_BUILD
asm("PWM2OFCON equ 0DB0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OFS                    :2;
        unsigned                        :2;
        unsigned OFO                    :1;
        unsigned OFM                    :2;
    };
    struct {
        unsigned PWM2OFS0               :1;
        unsigned PWM2OFS1               :1;
        unsigned                        :3;
        unsigned PWM2OFM0               :1;
        unsigned PWM2OFM1               :1;
    };
    struct {
        unsigned PWM2OFS                :2;
        unsigned                        :2;
        unsigned PWM2OFMC               :1;
        unsigned PWM2OFM                :2;
    };
    struct {
        unsigned OFS0                   :1;
        unsigned OFS1                   :1;
        unsigned                        :3;
        unsigned OFM0                   :1;
        unsigned OFM1                   :1;
    };
} PWM2OFCONbits_t;
extern volatile PWM2OFCONbits_t PWM2OFCONbits __at(0xDB0);
// bitfield macros
#define _PWM2OFCON_OFS_POSN                                 0x0
#define _PWM2OFCON_OFS_POSITION                             0x0
#define _PWM2OFCON_OFS_SIZE                                 0x2
#define _PWM2OFCON_OFS_LENGTH                               0x2
#define _PWM2OFCON_OFS_MASK                                 0x3
#define _PWM2OFCON_OFO_POSN                                 0x4
#define _PWM2OFCON_OFO_POSITION                             0x4
#define _PWM2OFCON_OFO_SIZE                                 0x1
#define _PWM2OFCON_OFO_LENGTH                               0x1
#define _PWM2OFCON_OFO_MASK                                 0x10
#define _PWM2OFCON_OFM_POSN                                 0x5
#define _PWM2OFCON_OFM_POSITION                             0x5
#define _PWM2OFCON_OFM_SIZE                                 0x2
#define _PWM2OFCON_OFM_LENGTH                               0x2
#define _PWM2OFCON_OFM_MASK                                 0x60
#define _PWM2OFCON_PWM2OFS0_POSN                            0x0
#define _PWM2OFCON_PWM2OFS0_POSITION                        0x0
#define _PWM2OFCON_PWM2OFS0_SIZE                            0x1
#define _PWM2OFCON_PWM2OFS0_LENGTH                          0x1
#define _PWM2OFCON_PWM2OFS0_MASK                            0x1
#define _PWM2OFCON_PWM2OFS1_POSN                            0x1
#define _PWM2OFCON_PWM2OFS1_POSITION                        0x1
#define _PWM2OFCON_PWM2OFS1_SIZE                            0x1
#define _PWM2OFCON_PWM2OFS1_LENGTH                          0x1
#define _PWM2OFCON_PWM2OFS1_MASK                            0x2
#define _PWM2OFCON_PWM2OFM0_POSN                            0x5
#define _PWM2OFCON_PWM2OFM0_POSITION                        0x5
#define _PWM2OFCON_PWM2OFM0_SIZE                            0x1
#define _PWM2OFCON_PWM2OFM0_LENGTH                          0x1
#define _PWM2OFCON_PWM2OFM0_MASK                            0x20
#define _PWM2OFCON_PWM2OFM1_POSN                            0x6
#define _PWM2OFCON_PWM2OFM1_POSITION                        0x6
#define _PWM2OFCON_PWM2OFM1_SIZE                            0x1
#define _PWM2OFCON_PWM2OFM1_LENGTH                          0x1
#define _PWM2OFCON_PWM2OFM1_MASK                            0x40
#define _PWM2OFCON_PWM2OFS_POSN                             0x0
#define _PWM2OFCON_PWM2OFS_POSITION                         0x0
#define _PWM2OFCON_PWM2OFS_SIZE                             0x2
#define _PWM2OFCON_PWM2OFS_LENGTH                           0x2
#define _PWM2OFCON_PWM2OFS_MASK                             0x3
#define _PWM2OFCON_PWM2OFMC_POSN                            0x4
#define _PWM2OFCON_PWM2OFMC_POSITION                        0x4
#define _PWM2OFCON_PWM2OFMC_SIZE                            0x1
#define _PWM2OFCON_PWM2OFMC_LENGTH                          0x1
#define _PWM2OFCON_PWM2OFMC_MASK                            0x10
#define _PWM2OFCON_PWM2OFM_POSN                             0x5
#define _PWM2OFCON_PWM2OFM_POSITION                         0x5
#define _PWM2OFCON_PWM2OFM_SIZE                             0x2
#define _PWM2OFCON_PWM2OFM_LENGTH                           0x2
#define _PWM2OFCON_PWM2OFM_MASK                             0x60
#define _PWM2OFCON_OFS0_POSN                                0x0
#define _PWM2OFCON_OFS0_POSITION                            0x0
#define _PWM2OFCON_OFS0_SIZE                                0x1
#define _PWM2OFCON_OFS0_LENGTH                              0x1
#define _PWM2OFCON_OFS0_MASK                                0x1
#define _PWM2OFCON_OFS1_POSN                                0x1
#define _PWM2OFCON_OFS1_POSITION                            0x1
#define _PWM2OFCON_OFS1_SIZE                                0x1
#define _PWM2OFCON_OFS1_LENGTH                              0x1
#define _PWM2OFCON_OFS1_MASK                                0x2
#define _PWM2OFCON_OFM0_POSN                                0x5
#define _PWM2OFCON_OFM0_POSITION                            0x5
#define _PWM2OFCON_OFM0_SIZE                                0x1
#define _PWM2OFCON_OFM0_LENGTH                              0x1
#define _PWM2OFCON_OFM0_MASK                                0x20
#define _PWM2OFCON_OFM1_POSN                                0x6
#define _PWM2OFCON_OFM1_POSITION                            0x6
#define _PWM2OFCON_OFM1_SIZE                                0x1
#define _PWM2OFCON_OFM1_LENGTH                              0x1
#define _PWM2OFCON_OFM1_MASK                                0x40

// Register: PWM3PH
#define PWM3PH PWM3PH
extern volatile unsigned short          PWM3PH              __at(0xDB1);
#ifndef _LIB_BUILD
asm("PWM3PH equ 0DB1h");
#endif

// Register: PWM3PHL
#define PWM3PHL PWM3PHL
extern volatile unsigned char           PWM3PHL             __at(0xDB1);
#ifndef _LIB_BUILD
asm("PWM3PHL equ 0DB1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PH                     :8;
    };
    struct {
        unsigned PWM3PHL0               :1;
        unsigned PWM3PHL1               :1;
        unsigned PWM3PHL2               :1;
        unsigned PWM3PHL3               :1;
        unsigned PWM3PHL4               :1;
        unsigned PWM3PHL5               :1;
        unsigned PWM3PHL6               :1;
        unsigned PWM3PHL7               :1;
    };
    struct {
        unsigned PWM3PHL                :8;
    };
} PWM3PHLbits_t;
