MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1578/mcu.h
extern volatile PWM3OFCONbits_t PWM3OFCONbits __at(0xDC0);
// bitfield macros
#define _PWM3OFCON_OFS_POSN                                 0x0
#define _PWM3OFCON_OFS_POSITION                             0x0
#define _PWM3OFCON_OFS_SIZE                                 0x2
#define _PWM3OFCON_OFS_LENGTH                               0x2
#define _PWM3OFCON_OFS_MASK                                 0x3
#define _PWM3OFCON_OFO_POSN                                 0x4
#define _PWM3OFCON_OFO_POSITION                             0x4
#define _PWM3OFCON_OFO_SIZE                                 0x1
#define _PWM3OFCON_OFO_LENGTH                               0x1
#define _PWM3OFCON_OFO_MASK                                 0x10
#define _PWM3OFCON_OFM_POSN                                 0x5
#define _PWM3OFCON_OFM_POSITION                             0x5
#define _PWM3OFCON_OFM_SIZE                                 0x2
#define _PWM3OFCON_OFM_LENGTH                               0x2
#define _PWM3OFCON_OFM_MASK                                 0x60
#define _PWM3OFCON_PWM3OFS0_POSN                            0x0
#define _PWM3OFCON_PWM3OFS0_POSITION                        0x0
#define _PWM3OFCON_PWM3OFS0_SIZE                            0x1
#define _PWM3OFCON_PWM3OFS0_LENGTH                          0x1
#define _PWM3OFCON_PWM3OFS0_MASK                            0x1
#define _PWM3OFCON_PWM3OFS1_POSN                            0x1
#define _PWM3OFCON_PWM3OFS1_POSITION                        0x1
#define _PWM3OFCON_PWM3OFS1_SIZE                            0x1
#define _PWM3OFCON_PWM3OFS1_LENGTH                          0x1
#define _PWM3OFCON_PWM3OFS1_MASK                            0x2
#define _PWM3OFCON_PWM3OFM0_POSN                            0x5
#define _PWM3OFCON_PWM3OFM0_POSITION                        0x5
#define _PWM3OFCON_PWM3OFM0_SIZE                            0x1
#define _PWM3OFCON_PWM3OFM0_LENGTH                          0x1
#define _PWM3OFCON_PWM3OFM0_MASK                            0x20
#define _PWM3OFCON_PWM3OFM1_POSN                            0x6
#define _PWM3OFCON_PWM3OFM1_POSITION                        0x6
#define _PWM3OFCON_PWM3OFM1_SIZE                            0x1
#define _PWM3OFCON_PWM3OFM1_LENGTH                          0x1
#define _PWM3OFCON_PWM3OFM1_MASK                            0x40
#define _PWM3OFCON_PWM3OFS_POSN                             0x0
#define _PWM3OFCON_PWM3OFS_POSITION                         0x0
#define _PWM3OFCON_PWM3OFS_SIZE                             0x2
#define _PWM3OFCON_PWM3OFS_LENGTH                           0x2
#define _PWM3OFCON_PWM3OFS_MASK                             0x3
#define _PWM3OFCON_PWM3OFMC_POSN                            0x4
#define _PWM3OFCON_PWM3OFMC_POSITION                        0x4
#define _PWM3OFCON_PWM3OFMC_SIZE                            0x1
#define _PWM3OFCON_PWM3OFMC_LENGTH                          0x1
#define _PWM3OFCON_PWM3OFMC_MASK                            0x10
#define _PWM3OFCON_PWM3OFM_POSN                             0x5
#define _PWM3OFCON_PWM3OFM_POSITION                         0x5
#define _PWM3OFCON_PWM3OFM_SIZE                             0x2
#define _PWM3OFCON_PWM3OFM_LENGTH                           0x2
#define _PWM3OFCON_PWM3OFM_MASK                             0x60
#define _PWM3OFCON_OFS0_POSN                                0x0
#define _PWM3OFCON_OFS0_POSITION                            0x0
#define _PWM3OFCON_OFS0_SIZE                                0x1
#define _PWM3OFCON_OFS0_LENGTH                              0x1
#define _PWM3OFCON_OFS0_MASK                                0x1
#define _PWM3OFCON_OFS1_POSN                                0x1
#define _PWM3OFCON_OFS1_POSITION                            0x1
#define _PWM3OFCON_OFS1_SIZE                                0x1
#define _PWM3OFCON_OFS1_LENGTH                              0x1
#define _PWM3OFCON_OFS1_MASK                                0x2
#define _PWM3OFCON_OFM0_POSN                                0x5
#define _PWM3OFCON_OFM0_POSITION                            0x5
#define _PWM3OFCON_OFM0_SIZE                                0x1
#define _PWM3OFCON_OFM0_LENGTH                              0x1
#define _PWM3OFCON_OFM0_MASK                                0x20
#define _PWM3OFCON_OFM1_POSN                                0x6
#define _PWM3OFCON_OFM1_POSITION                            0x6
#define _PWM3OFCON_OFM1_SIZE                                0x1
#define _PWM3OFCON_OFM1_LENGTH                              0x1
#define _PWM3OFCON_OFM1_MASK                                0x40

// Register: PWM4PH
#define PWM4PH PWM4PH
extern volatile unsigned short          PWM4PH              __at(0xDC1);
#ifndef _LIB_BUILD
asm("PWM4PH equ 0DC1h");
#endif

// Register: PWM4PHL
#define PWM4PHL PWM4PHL
extern volatile unsigned char           PWM4PHL             __at(0xDC1);
#ifndef _LIB_BUILD
asm("PWM4PHL equ 0DC1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PH                     :8;
    };
    struct {
        unsigned PWM4PHL0               :1;
        unsigned PWM4PHL1               :1;
        unsigned PWM4PHL2               :1;
        unsigned PWM4PHL3               :1;
        unsigned PWM4PHL4               :1;
        unsigned PWM4PHL5               :1;
        unsigned PWM4PHL6               :1;
        unsigned PWM4PHL7               :1;
    };
    struct {
        unsigned PWM4PHL                :8;
    };
} PWM4PHLbits_t;
extern volatile PWM4PHLbits_t PWM4PHLbits __at(0xDC1);
// bitfield macros
#define _PWM4PHL_PH_POSN                                    0x0
#define _PWM4PHL_PH_POSITION                                0x0
#define _PWM4PHL_PH_SIZE                                    0x8
#define _PWM4PHL_PH_LENGTH                                  0x8
#define _PWM4PHL_PH_MASK                                    0xFF
#define _PWM4PHL_PWM4PHL0_POSN                              0x0
#define _PWM4PHL_PWM4PHL0_POSITION                          0x0
#define _PWM4PHL_PWM4PHL0_SIZE                              0x1
#define _PWM4PHL_PWM4PHL0_LENGTH                            0x1
#define _PWM4PHL_PWM4PHL0_MASK                              0x1
#define _PWM4PHL_PWM4PHL1_POSN                              0x1
#define _PWM4PHL_PWM4PHL1_POSITION                          0x1
#define _PWM4PHL_PWM4PHL1_SIZE                              0x1
#define _PWM4PHL_PWM4PHL1_LENGTH                            0x1
#define _PWM4PHL_PWM4PHL1_MASK                              0x2
#define _PWM4PHL_PWM4PHL2_POSN                              0x2
#define _PWM4PHL_PWM4PHL2_POSITION                          0x2
#define _PWM4PHL_PWM4PHL2_SIZE                              0x1
#define _PWM4PHL_PWM4PHL2_LENGTH                            0x1
#define _PWM4PHL_PWM4PHL2_MASK                              0x4
#define _PWM4PHL_PWM4PHL3_POSN                              0x3
#define _PWM4PHL_PWM4PHL3_POSITION                          0x3
#define _PWM4PHL_PWM4PHL3_SIZE                              0x1
#define _PWM4PHL_PWM4PHL3_LENGTH                            0x1
#define _PWM4PHL_PWM4PHL3_MASK                              0x8
#define _PWM4PHL_PWM4PHL4_POSN                              0x4
#define _PWM4PHL_PWM4PHL4_POSITION                          0x4
#define _PWM4PHL_PWM4PHL4_SIZE                              0x1
#define _PWM4PHL_PWM4PHL4_LENGTH                            0x1
#define _PWM4PHL_PWM4PHL4_MASK                              0x10
#define _PWM4PHL_PWM4PHL5_POSN                              0x5
#define _PWM4PHL_PWM4PHL5_POSITION                          0x5
#define _PWM4PHL_PWM4PHL5_SIZE                              0x1
#define _PWM4PHL_PWM4PHL5_LENGTH                            0x1
#define _PWM4PHL_PWM4PHL5_MASK                              0x20
#define _PWM4PHL_PWM4PHL6_POSN                              0x6
#define _PWM4PHL_PWM4PHL6_POSITION                          0x6
#define _PWM4PHL_PWM4PHL6_SIZE                              0x1
#define _PWM4PHL_PWM4PHL6_LENGTH                            0x1
#define _PWM4PHL_PWM4PHL6_MASK                              0x40
#define _PWM4PHL_PWM4PHL7_POSN                              0x7
#define _PWM4PHL_PWM4PHL7_POSITION                          0x7
#define _PWM4PHL_PWM4PHL7_SIZE                              0x1
#define _PWM4PHL_PWM4PHL7_LENGTH                            0x1
#define _PWM4PHL_PWM4PHL7_MASK                              0x80
#define _PWM4PHL_PWM4PHL_POSN                               0x0
#define _PWM4PHL_PWM4PHL_POSITION                           0x0
#define _PWM4PHL_PWM4PHL_SIZE                               0x8
#define _PWM4PHL_PWM4PHL_LENGTH                             0x8
#define _PWM4PHL_PWM4PHL_MASK                               0xFF

// Register: PWM4PHH
#define PWM4PHH PWM4PHH
extern volatile unsigned char           PWM4PHH             __at(0xDC2);
#ifndef _LIB_BUILD
asm("PWM4PHH equ 0DC2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PH                     :8;
    };
    struct {
        unsigned PWM4PHH0               :1;
        unsigned PWM4PHH1               :1;
        unsigned PWM4PHH2               :1;
        unsigned PWM4PHH3               :1;
        unsigned PWM4PHH4               :1;
        unsigned PWM4PHH5               :1;
        unsigned PWM4PHH6               :1;
        unsigned PWM4PHH7               :1;
    };
    struct {
        unsigned PWM4PHH                :8;
    };
} PWM4PHHbits_t;
extern volatile PWM4PHHbits_t PWM4PHHbits __at(0xDC2);
// bitfield macros
#define _PWM4PHH_PH_POSN                                    0x0
#define _PWM4PHH_PH_POSITION                                0x0
#define _PWM4PHH_PH_SIZE                                    0x8
#define _PWM4PHH_PH_LENGTH                                  0x8
#define _PWM4PHH_PH_MASK                                    0xFF
#define _PWM4PHH_PWM4PHH0_POSN                              0x0
#define _PWM4PHH_PWM4PHH0_POSITION                          0x0
#define _PWM4PHH_PWM4PHH0_SIZE                              0x1
#define _PWM4PHH_PWM4PHH0_LENGTH                            0x1
#define _PWM4PHH_PWM4PHH0_MASK                              0x1
#define _PWM4PHH_PWM4PHH1_POSN                              0x1
#define _PWM4PHH_PWM4PHH1_POSITION                          0x1
#define _PWM4PHH_PWM4PHH1_SIZE                              0x1
#define _PWM4PHH_PWM4PHH1_LENGTH                            0x1
#define _PWM4PHH_PWM4PHH1_MASK                              0x2
#define _PWM4PHH_PWM4PHH2_POSN                              0x2
#define _PWM4PHH_PWM4PHH2_POSITION                          0x2
#define _PWM4PHH_PWM4PHH2_SIZE                              0x1
#define _PWM4PHH_PWM4PHH2_LENGTH                            0x1
#define _PWM4PHH_PWM4PHH2_MASK                              0x4
#define _PWM4PHH_PWM4PHH3_POSN                              0x3
#define _PWM4PHH_PWM4PHH3_POSITION                          0x3
#define _PWM4PHH_PWM4PHH3_SIZE                              0x1
#define _PWM4PHH_PWM4PHH3_LENGTH                            0x1
#define _PWM4PHH_PWM4PHH3_MASK                              0x8
#define _PWM4PHH_PWM4PHH4_POSN                              0x4
#define _PWM4PHH_PWM4PHH4_POSITION                          0x4
#define _PWM4PHH_PWM4PHH4_SIZE                              0x1
#define _PWM4PHH_PWM4PHH4_LENGTH                            0x1
#define _PWM4PHH_PWM4PHH4_MASK                              0x10
#define _PWM4PHH_PWM4PHH5_POSN                              0x5
#define _PWM4PHH_PWM4PHH5_POSITION                          0x5
#define _PWM4PHH_PWM4PHH5_SIZE                              0x1
#define _PWM4PHH_PWM4PHH5_LENGTH                            0x1
#define _PWM4PHH_PWM4PHH5_MASK                              0x20
#define _PWM4PHH_PWM4PHH6_POSN                              0x6
#define _PWM4PHH_PWM4PHH6_POSITION                          0x6
#define _PWM4PHH_PWM4PHH6_SIZE                              0x1
#define _PWM4PHH_PWM4PHH6_LENGTH                            0x1
#define _PWM4PHH_PWM4PHH6_MASK                              0x40
#define _PWM4PHH_PWM4PHH7_POSN                              0x7
#define _PWM4PHH_PWM4PHH7_POSITION                          0x7
#define _PWM4PHH_PWM4PHH7_SIZE                              0x1
#define _PWM4PHH_PWM4PHH7_LENGTH                            0x1
#define _PWM4PHH_PWM4PHH7_MASK                              0x80
#define _PWM4PHH_PWM4PHH_POSN                               0x0
#define _PWM4PHH_PWM4PHH_POSITION                           0x0
#define _PWM4PHH_PWM4PHH_SIZE                               0x8
#define _PWM4PHH_PWM4PHH_LENGTH                             0x8
#define _PWM4PHH_PWM4PHH_MASK                               0xFF

// Register: PWM4DC
#define PWM4DC PWM4DC
extern volatile unsigned short          PWM4DC              __at(0xDC3);
#ifndef _LIB_BUILD
asm("PWM4DC equ 0DC3h");
#endif

// Register: PWM4DCL
#define PWM4DCL PWM4DCL
extern volatile unsigned char           PWM4DCL             __at(0xDC3);
#ifndef _LIB_BUILD
asm("PWM4DCL equ 0DC3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DC                     :8;
    };
    struct {
        unsigned PWM4DCL0               :1;
        unsigned PWM4DCL1               :1;
        unsigned PWM4DCL2               :1;
        unsigned PWM4DCL3               :1;
        unsigned PWM4DCL4               :1;
        unsigned PWM4DCL5               :1;
        unsigned PWM4DCL6               :1;
        unsigned PWM4DCL7               :1;
    };
    struct {
        unsigned PWM4DCL                :8;
    };
} PWM4DCLbits_t;
extern volatile PWM4DCLbits_t PWM4DCLbits __at(0xDC3);
// bitfield macros
#define _PWM4DCL_DC_POSN                                    0x0
#define _PWM4DCL_DC_POSITION                                0x0
#define _PWM4DCL_DC_SIZE                                    0x8
#define _PWM4DCL_DC_LENGTH                                  0x8
#define _PWM4DCL_DC_MASK                                    0xFF
#define _PWM4DCL_PWM4DCL0_POSN                              0x0
#define _PWM4DCL_PWM4DCL0_POSITION                          0x0
#define _PWM4DCL_PWM4DCL0_SIZE                              0x1
#define _PWM4DCL_PWM4DCL0_LENGTH                            0x1
#define _PWM4DCL_PWM4DCL0_MASK                              0x1
#define _PWM4DCL_PWM4DCL1_POSN                              0x1
#define _PWM4DCL_PWM4DCL1_POSITION                          0x1
#define _PWM4DCL_PWM4DCL1_SIZE                              0x1
#define _PWM4DCL_PWM4DCL1_LENGTH                            0x1
#define _PWM4DCL_PWM4DCL1_MASK                              0x2
#define _PWM4DCL_PWM4DCL2_POSN                              0x2
#define _PWM4DCL_PWM4DCL2_POSITION                          0x2
#define _PWM4DCL_PWM4DCL2_SIZE                              0x1
#define _PWM4DCL_PWM4DCL2_LENGTH                            0x1
#define _PWM4DCL_PWM4DCL2_MASK                              0x4
#define _PWM4DCL_PWM4DCL3_POSN                              0x3
#define _PWM4DCL_PWM4DCL3_POSITION                          0x3
#define _PWM4DCL_PWM4DCL3_SIZE                              0x1
#define _PWM4DCL_PWM4DCL3_LENGTH                            0x1
#define _PWM4DCL_PWM4DCL3_MASK                              0x8
#define _PWM4DCL_PWM4DCL4_POSN                              0x4
#define _PWM4DCL_PWM4DCL4_POSITION                          0x4
#define _PWM4DCL_PWM4DCL4_SIZE                              0x1
#define _PWM4DCL_PWM4DCL4_LENGTH                            0x1
#define _PWM4DCL_PWM4DCL4_MASK                              0x10
#define _PWM4DCL_PWM4DCL5_POSN                              0x5
#define _PWM4DCL_PWM4DCL5_POSITION                          0x5
#define _PWM4DCL_PWM4DCL5_SIZE                              0x1
#define _PWM4DCL_PWM4DCL5_LENGTH                            0x1
#define _PWM4DCL_PWM4DCL5_MASK                              0x20
#define _PWM4DCL_PWM4DCL6_POSN                              0x6
#define _PWM4DCL_PWM4DCL6_POSITION                          0x6
#define _PWM4DCL_PWM4DCL6_SIZE                              0x1
#define _PWM4DCL_PWM4DCL6_LENGTH                            0x1
#define _PWM4DCL_PWM4DCL6_MASK                              0x40
#define _PWM4DCL_PWM4DCL7_POSN                              0x7
#define _PWM4DCL_PWM4DCL7_POSITION                          0x7
#define _PWM4DCL_PWM4DCL7_SIZE                              0x1
#define _PWM4DCL_PWM4DCL7_LENGTH                            0x1
#define _PWM4DCL_PWM4DCL7_MASK                              0x80
#define _PWM4DCL_PWM4DCL_POSN                               0x0
#define _PWM4DCL_PWM4DCL_POSITION                           0x0
#define _PWM4DCL_PWM4DCL_SIZE                               0x8
#define _PWM4DCL_PWM4DCL_LENGTH                             0x8
#define _PWM4DCL_PWM4DCL_MASK                               0xFF

