MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1578/mcu.h
extern volatile __bit                   LATC3               __at(0x873);	// @ (0x10E * 8 + 3)
#define                                 LATC3_bit           _BIT_ACCESS(LATC,3)
// LATC<LATC4>
extern volatile __bit                   LATC4               __at(0x874);	// @ (0x10E * 8 + 4)
#define                                 LATC4_bit           _BIT_ACCESS(LATC,4)
// LATC<LATC5>
extern volatile __bit                   LATC5               __at(0x875);	// @ (0x10E * 8 + 5)
#define                                 LATC5_bit           _BIT_ACCESS(LATC,5)
// LATC<LATC6>
extern volatile __bit                   LATC6               __at(0x876);	// @ (0x10E * 8 + 6)
#define                                 LATC6_bit           _BIT_ACCESS(LATC,6)
// LATC<LATC7>
extern volatile __bit                   LATC7               __at(0x877);	// @ (0x10E * 8 + 7)
#define                                 LATC7_bit           _BIT_ACCESS(LATC,7)
// OSCSTAT<LFIOFR>
extern volatile __bit                   LFIOFR              __at(0x4D1);	// @ (0x9A * 8 + 1)
#define                                 LFIOFR_bit          _BIT_ACCESS(OSCSTAT,1)
// PMCON1<LWLO>
extern volatile __bit                   LWLO                __at(0xCAD);	// @ (0x195 * 8 + 5)
#define                                 LWLO_bit            _BIT_ACCESS(PMCON1,5)
// CMOUT<MC1OUT>
extern volatile __bit                   MC1OUT              __at(0x8A8);	// @ (0x115 * 8 + 0)
#define                                 MC1OUT_bit          _BIT_ACCESS(CMOUT,0)
// CMOUT<MC2OUT>
extern volatile __bit                   MC2OUT              __at(0x8A9);	// @ (0x115 * 8 + 1)
#define                                 MC2OUT_bit          _BIT_ACCESS(CMOUT,1)
// OSCSTAT<MFIOFR>
extern volatile __bit                   MFIOFR              __at(0x4D2);	// @ (0x9A * 8 + 2)
#define                                 MFIOFR_bit          _BIT_ACCESS(OSCSTAT,2)
// PWMEN<MPWM1EN>
extern volatile __bit                   MPWM1EN             __at(0x6C70);	// @ (0xD8E * 8 + 0)
#define                                 MPWM1EN_bit         _BIT_ACCESS(PWMEN,0)
// PWMLD<MPWM1LD>
extern volatile __bit                   MPWM1LD             __at(0x6C78);	// @ (0xD8F * 8 + 0)
#define                                 MPWM1LD_bit         _BIT_ACCESS(PWMLD,0)
// PWMOUT<MPWM1OUT>
extern volatile __bit                   MPWM1OUT            __at(0x6C80);	// @ (0xD90 * 8 + 0)
#define                                 MPWM1OUT_bit        _BIT_ACCESS(PWMOUT,0)
// PWMEN<MPWM2EN>
extern volatile __bit                   MPWM2EN             __at(0x6C71);	// @ (0xD8E * 8 + 1)
#define                                 MPWM2EN_bit         _BIT_ACCESS(PWMEN,1)
// PWMLD<MPWM2LD>
extern volatile __bit                   MPWM2LD             __at(0x6C79);	// @ (0xD8F * 8 + 1)
#define                                 MPWM2LD_bit         _BIT_ACCESS(PWMLD,1)
// PWMOUT<MPWM2OUT>
extern volatile __bit                   MPWM2OUT            __at(0x6C81);	// @ (0xD90 * 8 + 1)
#define                                 MPWM2OUT_bit        _BIT_ACCESS(PWMOUT,1)
// PWMEN<MPWM3EN>
extern volatile __bit                   MPWM3EN             __at(0x6C72);	// @ (0xD8E * 8 + 2)
#define                                 MPWM3EN_bit         _BIT_ACCESS(PWMEN,2)
// PWMLD<MPWM3LD>
extern volatile __bit                   MPWM3LD             __at(0x6C7A);	// @ (0xD8F * 8 + 2)
#define                                 MPWM3LD_bit         _BIT_ACCESS(PWMLD,2)
// PWMOUT<MPWM3OUT>
extern volatile __bit                   MPWM3OUT            __at(0x6C82);	// @ (0xD90 * 8 + 2)
#define                                 MPWM3OUT_bit        _BIT_ACCESS(PWMOUT,2)
// ODCONA<ODA0>
extern volatile __bit                   ODA0                __at(0x1460);	// @ (0x28C * 8 + 0)
#define                                 ODA0_bit            _BIT_ACCESS(ODCONA,0)
// ODCONA<ODA1>
extern volatile __bit                   ODA1                __at(0x1461);	// @ (0x28C * 8 + 1)
#define                                 ODA1_bit            _BIT_ACCESS(ODCONA,1)
// ODCONA<ODA2>
extern volatile __bit                   ODA2                __at(0x1462);	// @ (0x28C * 8 + 2)
#define                                 ODA2_bit            _BIT_ACCESS(ODCONA,2)
// ODCONA<ODA4>
extern volatile __bit                   ODA4                __at(0x1464);	// @ (0x28C * 8 + 4)
#define                                 ODA4_bit            _BIT_ACCESS(ODCONA,4)
// ODCONA<ODA5>
extern volatile __bit                   ODA5                __at(0x1465);	// @ (0x28C * 8 + 5)
#define                                 ODA5_bit            _BIT_ACCESS(ODCONA,5)
// ODCONB<ODB4>
extern volatile __bit                   ODB4                __at(0x146C);	// @ (0x28D * 8 + 4)
#define                                 ODB4_bit            _BIT_ACCESS(ODCONB,4)
// ODCONB<ODB5>
extern volatile __bit                   ODB5                __at(0x146D);	// @ (0x28D * 8 + 5)
#define                                 ODB5_bit            _BIT_ACCESS(ODCONB,5)
// ODCONB<ODB6>
extern volatile __bit                   ODB6                __at(0x146E);	// @ (0x28D * 8 + 6)
#define                                 ODB6_bit            _BIT_ACCESS(ODCONB,6)
// ODCONB<ODB7>
extern volatile __bit                   ODB7                __at(0x146F);	// @ (0x28D * 8 + 7)
#define                                 ODB7_bit            _BIT_ACCESS(ODCONB,7)
// ODCONC<ODC0>
extern volatile __bit                   ODC0                __at(0x1470);	// @ (0x28E * 8 + 0)
#define                                 ODC0_bit            _BIT_ACCESS(ODCONC,0)
// ODCONC<ODC1>
extern volatile __bit                   ODC1                __at(0x1471);	// @ (0x28E * 8 + 1)
#define                                 ODC1_bit            _BIT_ACCESS(ODCONC,1)
// ODCONC<ODC2>
extern volatile __bit                   ODC2                __at(0x1472);	// @ (0x28E * 8 + 2)
#define                                 ODC2_bit            _BIT_ACCESS(ODCONC,2)
// ODCONC<ODC3>
extern volatile __bit                   ODC3                __at(0x1473);	// @ (0x28E * 8 + 3)
#define                                 ODC3_bit            _BIT_ACCESS(ODCONC,3)
// ODCONC<ODC4>
extern volatile __bit                   ODC4                __at(0x1474);	// @ (0x28E * 8 + 4)
#define                                 ODC4_bit            _BIT_ACCESS(ODCONC,4)
// ODCONC<ODC5>
extern volatile __bit                   ODC5                __at(0x1475);	// @ (0x28E * 8 + 5)
#define                                 ODC5_bit            _BIT_ACCESS(ODCONC,5)
// ODCONC<ODC6>
extern volatile __bit                   ODC6                __at(0x1476);	// @ (0x28E * 8 + 6)
#define                                 ODC6_bit            _BIT_ACCESS(ODCONC,6)
// ODCONC<ODC7>
extern volatile __bit                   ODC7                __at(0x1477);	// @ (0x28E * 8 + 7)
#define                                 ODC7_bit            _BIT_ACCESS(ODCONC,7)
// RCSTA<OERR>
extern volatile __bit                   OERR                __at(0xCE9);	// @ (0x19D * 8 + 1)
#define                                 OERR_bit            _BIT_ACCESS(RCSTA,1)
// OSCSTAT<OSTS>
extern volatile __bit                   OSTS                __at(0x4D5);	// @ (0x9A * 8 + 5)
#define                                 OSTS_bit            _BIT_ACCESS(OSCSTAT,5)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x5E);	// @ (0xB * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// OSCSTAT<PLLR>
extern volatile __bit                   PLLR                __at(0x4D6);	// @ (0x9A * 8 + 6)
#define                                 PLLR_bit            _BIT_ACCESS(OSCSTAT,6)
// PPSLOCK<PPSLOCKED>
extern volatile __bit                   PPSLOCKED           __at(0x7078);	// @ (0xE0F * 8 + 0)
#define                                 PPSLOCKED_bit       _BIT_ACCESS(PPSLOCK,0)
// OPTION_REG<PSA>
extern volatile __bit                   PSA                 __at(0x4AB);	// @ (0x95 * 8 + 3)
#define                                 PSA_bit             _BIT_ACCESS(OPTION_REG,3)
// PWM1CLKCON<PWM1CS0>
extern volatile __bit                   PWM1CS0             __at(0x6CF0);	// @ (0xD9E * 8 + 0)
#define                                 PWM1CS0_bit         _BIT_ACCESS(PWM1CLKCON,0)
// PWM1CLKCON<PWM1CS1>
extern volatile __bit                   PWM1CS1             __at(0x6CF1);	// @ (0xD9E * 8 + 1)
#define                                 PWM1CS1_bit         _BIT_ACCESS(PWM1CLKCON,1)
// PWM1DCH<PWM1DCH0>
extern volatile __bit                   PWM1DCH0            __at(0x6CA0);	// @ (0xD94 * 8 + 0)
#define                                 PWM1DCH0_bit        _BIT_ACCESS(PWM1DCH,0)
// PWM1DCH<PWM1DCH1>
extern volatile __bit                   PWM1DCH1            __at(0x6CA1);	// @ (0xD94 * 8 + 1)
#define                                 PWM1DCH1_bit        _BIT_ACCESS(PWM1DCH,1)
// PWM1DCH<PWM1DCH2>
extern volatile __bit                   PWM1DCH2            __at(0x6CA2);	// @ (0xD94 * 8 + 2)
#define                                 PWM1DCH2_bit        _BIT_ACCESS(PWM1DCH,2)
// PWM1DCH<PWM1DCH3>
extern volatile __bit                   PWM1DCH3            __at(0x6CA3);	// @ (0xD94 * 8 + 3)
#define                                 PWM1DCH3_bit        _BIT_ACCESS(PWM1DCH,3)
// PWM1DCH<PWM1DCH4>
extern volatile __bit                   PWM1DCH4            __at(0x6CA4);	// @ (0xD94 * 8 + 4)
#define                                 PWM1DCH4_bit        _BIT_ACCESS(PWM1DCH,4)
// PWM1DCH<PWM1DCH5>
extern volatile __bit                   PWM1DCH5            __at(0x6CA5);	// @ (0xD94 * 8 + 5)
#define                                 PWM1DCH5_bit        _BIT_ACCESS(PWM1DCH,5)
// PWM1DCH<PWM1DCH6>
extern volatile __bit                   PWM1DCH6            __at(0x6CA6);	// @ (0xD94 * 8 + 6)
#define                                 PWM1DCH6_bit        _BIT_ACCESS(PWM1DCH,6)
// PWM1DCH<PWM1DCH7>
extern volatile __bit                   PWM1DCH7            __at(0x6CA7);	// @ (0xD94 * 8 + 7)
#define                                 PWM1DCH7_bit        _BIT_ACCESS(PWM1DCH,7)
// PWM1INTE<PWM1DCIE>
extern volatile __bit                   PWM1DCIE            __at(0x6CE1);	// @ (0xD9C * 8 + 1)
#define                                 PWM1DCIE_bit        _BIT_ACCESS(PWM1INTE,1)
// PWM1INTF<PWM1DCIF>
extern volatile __bit                   PWM1DCIF            __at(0x6CE9);	// @ (0xD9D * 8 + 1)
#define                                 PWM1DCIF_bit        _BIT_ACCESS(PWM1INTF,1)
// PWM1DCL<PWM1DCL0>
extern volatile __bit                   PWM1DCL0            __at(0x6C98);	// @ (0xD93 * 8 + 0)
#define                                 PWM1DCL0_bit        _BIT_ACCESS(PWM1DCL,0)
// PWM1DCL<PWM1DCL1>
extern volatile __bit                   PWM1DCL1            __at(0x6C99);	// @ (0xD93 * 8 + 1)
#define                                 PWM1DCL1_bit        _BIT_ACCESS(PWM1DCL,1)
// PWM1DCL<PWM1DCL2>
extern volatile __bit                   PWM1DCL2            __at(0x6C9A);	// @ (0xD93 * 8 + 2)
#define                                 PWM1DCL2_bit        _BIT_ACCESS(PWM1DCL,2)
// PWM1DCL<PWM1DCL3>
extern volatile __bit                   PWM1DCL3            __at(0x6C9B);	// @ (0xD93 * 8 + 3)
#define                                 PWM1DCL3_bit        _BIT_ACCESS(PWM1DCL,3)
// PWM1DCL<PWM1DCL4>
extern volatile __bit                   PWM1DCL4            __at(0x6C9C);	// @ (0xD93 * 8 + 4)
#define                                 PWM1DCL4_bit        _BIT_ACCESS(PWM1DCL,4)
// PWM1DCL<PWM1DCL5>
extern volatile __bit                   PWM1DCL5            __at(0x6C9D);	// @ (0xD93 * 8 + 5)
#define                                 PWM1DCL5_bit        _BIT_ACCESS(PWM1DCL,5)
// PWM1DCL<PWM1DCL6>
extern volatile __bit                   PWM1DCL6            __at(0x6C9E);	// @ (0xD93 * 8 + 6)
#define                                 PWM1DCL6_bit        _BIT_ACCESS(PWM1DCL,6)
// PWM1DCL<PWM1DCL7>
extern volatile __bit                   PWM1DCL7            __at(0x6C9F);	// @ (0xD93 * 8 + 7)
#define                                 PWM1DCL7_bit        _BIT_ACCESS(PWM1DCL,7)
// PWM1CON<PWM1EN>
extern volatile __bit                   PWM1EN              __at(0x6CDF);	// @ (0xD9B * 8 + 7)
#define                                 PWM1EN_bit          _BIT_ACCESS(PWM1CON,7)
// PWMEN<PWM1EN_A>
extern volatile __bit                   PWM1EN_A            __at(0x6C70);	// @ (0xD8E * 8 + 0)
#define                                 PWM1EN_A_bit        _BIT_ACCESS(PWMEN,0)
// PIE3<PWM1IE>
extern volatile __bit                   PWM1IE              __at(0x49C);	// @ (0x93 * 8 + 4)
#define                                 PWM1IE_bit          _BIT_ACCESS(PIE3,4)
// PIR3<PWM1IF>
extern volatile __bit                   PWM1IF              __at(0x9C);	// @ (0x13 * 8 + 4)
#define                                 PWM1IF_bit          _BIT_ACCESS(PIR3,4)
// PWM1LDCON<PWM1LD>
extern volatile __bit                   PWM1LD              __at(0x6CFF);	// @ (0xD9F * 8 + 7)
#define                                 PWM1LD_bit          _BIT_ACCESS(PWM1LDCON,7)
// PWMLD<PWM1LDA_A>
extern volatile __bit                   PWM1LDA_A           __at(0x6C78);	// @ (0xD8F * 8 + 0)
#define                                 PWM1LDA_A_bit       _BIT_ACCESS(PWMLD,0)
// PWM1LDCON<PWM1LDM>
extern volatile __bit                   PWM1LDM             __at(0x6CFE);	// @ (0xD9F * 8 + 6)
#define                                 PWM1LDM_bit         _BIT_ACCESS(PWM1LDCON,6)
// PWM1LDCON<PWM1LDS0>
extern volatile __bit                   PWM1LDS0            __at(0x6CF8);	// @ (0xD9F * 8 + 0)
#define                                 PWM1LDS0_bit        _BIT_ACCESS(PWM1LDCON,0)
// PWM1LDCON<PWM1LDS1>
extern volatile __bit                   PWM1LDS1            __at(0x6CF9);	// @ (0xD9F * 8 + 1)
#define                                 PWM1LDS1_bit        _BIT_ACCESS(PWM1LDCON,1)
// PWM1CON<PWM1MODE0>
extern volatile __bit                   PWM1MODE0           __at(0x6CDA);	// @ (0xD9B * 8 + 2)
#define                                 PWM1MODE0_bit       _BIT_ACCESS(PWM1CON,2)
// PWM1CON<PWM1MODE1>
extern volatile __bit                   PWM1MODE1           __at(0x6CDB);	// @ (0xD9B * 8 + 3)
#define                                 PWM1MODE1_bit       _BIT_ACCESS(PWM1CON,3)
// PWM1CON<PWM1OE>
extern volatile __bit                   PWM1OE              __at(0x6CDE);	// @ (0xD9B * 8 + 6)
#define                                 PWM1OE_bit          _BIT_ACCESS(PWM1CON,6)
// PWM1OFH<PWM1OFH0>
extern volatile __bit                   PWM1OFH0            __at(0x6CC0);	// @ (0xD98 * 8 + 0)
#define                                 PWM1OFH0_bit        _BIT_ACCESS(PWM1OFH,0)
// PWM1OFH<PWM1OFH1>
extern volatile __bit                   PWM1OFH1            __at(0x6CC1);	// @ (0xD98 * 8 + 1)
#define                                 PWM1OFH1_bit        _BIT_ACCESS(PWM1OFH,1)
// PWM1OFH<PWM1OFH2>
extern volatile __bit                   PWM1OFH2            __at(0x6CC2);	// @ (0xD98 * 8 + 2)
#define                                 PWM1OFH2_bit        _BIT_ACCESS(PWM1OFH,2)
// PWM1OFH<PWM1OFH3>
extern volatile __bit                   PWM1OFH3            __at(0x6CC3);	// @ (0xD98 * 8 + 3)
#define                                 PWM1OFH3_bit        _BIT_ACCESS(PWM1OFH,3)
// PWM1OFH<PWM1OFH4>
extern volatile __bit                   PWM1OFH4            __at(0x6CC4);	// @ (0xD98 * 8 + 4)
#define                                 PWM1OFH4_bit        _BIT_ACCESS(PWM1OFH,4)
// PWM1OFH<PWM1OFH5>
extern volatile __bit                   PWM1OFH5            __at(0x6CC5);	// @ (0xD98 * 8 + 5)
#define                                 PWM1OFH5_bit        _BIT_ACCESS(PWM1OFH,5)
// PWM1OFH<PWM1OFH6>
extern volatile __bit                   PWM1OFH6            __at(0x6CC6);	// @ (0xD98 * 8 + 6)
#define                                 PWM1OFH6_bit        _BIT_ACCESS(PWM1OFH,6)
// PWM1OFH<PWM1OFH7>
extern volatile __bit                   PWM1OFH7            __at(0x6CC7);	// @ (0xD98 * 8 + 7)
#define                                 PWM1OFH7_bit        _BIT_ACCESS(PWM1OFH,7)
// PWM1INTE<PWM1OFIE>
extern volatile __bit                   PWM1OFIE            __at(0x6CE3);	// @ (0xD9C * 8 + 3)
#define                                 PWM1OFIE_bit        _BIT_ACCESS(PWM1INTE,3)
// PWM1INTF<PWM1OFIF>
extern volatile __bit                   PWM1OFIF            __at(0x6CEB);	// @ (0xD9D * 8 + 3)
#define                                 PWM1OFIF_bit        _BIT_ACCESS(PWM1INTF,3)
// PWM1OFL<PWM1OFL0>
extern volatile __bit                   PWM1OFL0            __at(0x6CB8);	// @ (0xD97 * 8 + 0)
#define                                 PWM1OFL0_bit        _BIT_ACCESS(PWM1OFL,0)
// PWM1OFL<PWM1OFL1>
extern volatile __bit                   PWM1OFL1            __at(0x6CB9);	// @ (0xD97 * 8 + 1)
#define                                 PWM1OFL1_bit        _BIT_ACCESS(PWM1OFL,1)
// PWM1OFL<PWM1OFL2>
extern volatile __bit                   PWM1OFL2            __at(0x6CBA);	// @ (0xD97 * 8 + 2)
#define                                 PWM1OFL2_bit        _BIT_ACCESS(PWM1OFL,2)
// PWM1OFL<PWM1OFL3>
extern volatile __bit                   PWM1OFL3            __at(0x6CBB);	// @ (0xD97 * 8 + 3)
#define                                 PWM1OFL3_bit        _BIT_ACCESS(PWM1OFL,3)
// PWM1OFL<PWM1OFL4>
extern volatile __bit                   PWM1OFL4            __at(0x6CBC);	// @ (0xD97 * 8 + 4)
#define                                 PWM1OFL4_bit        _BIT_ACCESS(PWM1OFL,4)
// PWM1OFL<PWM1OFL5>
extern volatile __bit                   PWM1OFL5            __at(0x6CBD);	// @ (0xD97 * 8 + 5)
#define                                 PWM1OFL5_bit        _BIT_ACCESS(PWM1OFL,5)
// PWM1OFL<PWM1OFL6>
extern volatile __bit                   PWM1OFL6            __at(0x6CBE);	// @ (0xD97 * 8 + 6)
#define                                 PWM1OFL6_bit        _BIT_ACCESS(PWM1OFL,6)
// PWM1OFL<PWM1OFL7>
extern volatile __bit                   PWM1OFL7            __at(0x6CBF);	// @ (0xD97 * 8 + 7)
#define                                 PWM1OFL7_bit        _BIT_ACCESS(PWM1OFL,7)
// PWM1OFCON<PWM1OFM0>
extern volatile __bit                   PWM1OFM0            __at(0x6D05);	// @ (0xDA0 * 8 + 5)
#define                                 PWM1OFM0_bit        _BIT_ACCESS(PWM1OFCON,5)
// PWM1OFCON<PWM1OFM1>
extern volatile __bit                   PWM1OFM1            __at(0x6D06);	// @ (0xDA0 * 8 + 6)
#define                                 PWM1OFM1_bit        _BIT_ACCESS(PWM1OFCON,6)
// PWM1OFCON<PWM1OFMC>
extern volatile __bit                   PWM1OFMC            __at(0x6D04);	// @ (0xDA0 * 8 + 4)
#define                                 PWM1OFMC_bit        _BIT_ACCESS(PWM1OFCON,4)
// PWM1OFCON<PWM1OFS0>
extern volatile __bit                   PWM1OFS0            __at(0x6D00);	// @ (0xDA0 * 8 + 0)
#define                                 PWM1OFS0_bit        _BIT_ACCESS(PWM1OFCON,0)
// PWM1OFCON<PWM1OFS1>
extern volatile __bit                   PWM1OFS1            __at(0x6D01);	// @ (0xDA0 * 8 + 1)
#define                                 PWM1OFS1_bit        _BIT_ACCESS(PWM1OFCON,1)
// PWM1CON<PWM1OUT>
extern volatile __bit                   PWM1OUT             __at(0x6CDD);	// @ (0xD9B * 8 + 5)
#define                                 PWM1OUT_bit         _BIT_ACCESS(PWM1CON,5)
// PWMOUT<PWM1OUT_A>
extern volatile __bit                   PWM1OUT_A           __at(0x6C80);	// @ (0xD90 * 8 + 0)
#define                                 PWM1OUT_A_bit       _BIT_ACCESS(PWMOUT,0)
// PWM1PHH<PWM1PHH0>
extern volatile __bit                   PWM1PHH0            __at(0x6C90);	// @ (0xD92 * 8 + 0)
#define                                 PWM1PHH0_bit        _BIT_ACCESS(PWM1PHH,0)
// PWM1PHH<PWM1PHH1>
extern volatile __bit                   PWM1PHH1            __at(0x6C91);	// @ (0xD92 * 8 + 1)
#define                                 PWM1PHH1_bit        _BIT_ACCESS(PWM1PHH,1)
// PWM1PHH<PWM1PHH2>
extern volatile __bit                   PWM1PHH2            __at(0x6C92);	// @ (0xD92 * 8 + 2)
#define                                 PWM1PHH2_bit        _BIT_ACCESS(PWM1PHH,2)
// PWM1PHH<PWM1PHH3>
extern volatile __bit                   PWM1PHH3            __at(0x6C93);	// @ (0xD92 * 8 + 3)
#define                                 PWM1PHH3_bit        _BIT_ACCESS(PWM1PHH,3)
// PWM1PHH<PWM1PHH4>
extern volatile __bit                   PWM1PHH4            __at(0x6C94);	// @ (0xD92 * 8 + 4)
#define                                 PWM1PHH4_bit        _BIT_ACCESS(PWM1PHH,4)
// PWM1PHH<PWM1PHH5>
extern volatile __bit                   PWM1PHH5            __at(0x6C95);	// @ (0xD92 * 8 + 5)
#define                                 PWM1PHH5_bit        _BIT_ACCESS(PWM1PHH,5)
// PWM1PHH<PWM1PHH6>
extern volatile __bit                   PWM1PHH6            __at(0x6C96);	// @ (0xD92 * 8 + 6)
#define                                 PWM1PHH6_bit        _BIT_ACCESS(PWM1PHH,6)
// PWM1PHH<PWM1PHH7>
extern volatile __bit                   PWM1PHH7            __at(0x6C97);	// @ (0xD92 * 8 + 7)
#define                                 PWM1PHH7_bit        _BIT_ACCESS(PWM1PHH,7)
// PWM1INTE<PWM1PHIE>
extern volatile __bit                   PWM1PHIE            __at(0x6CE2);	// @ (0xD9C * 8 + 2)
#define                                 PWM1PHIE_bit        _BIT_ACCESS(PWM1INTE,2)
// PWM1INTF<PWM1PHIF>
extern volatile __bit                   PWM1PHIF            __at(0x6CEA);	// @ (0xD9D * 8 + 2)
#define                                 PWM1PHIF_bit        _BIT_ACCESS(PWM1INTF,2)
// PWM1PHL<PWM1PHL0>
extern volatile __bit                   PWM1PHL0            __at(0x6C88);	// @ (0xD91 * 8 + 0)
#define                                 PWM1PHL0_bit        _BIT_ACCESS(PWM1PHL,0)
// PWM1PHL<PWM1PHL1>
extern volatile __bit                   PWM1PHL1            __at(0x6C89);	// @ (0xD91 * 8 + 1)
#define                                 PWM1PHL1_bit        _BIT_ACCESS(PWM1PHL,1)
// PWM1PHL<PWM1PHL2>
extern volatile __bit                   PWM1PHL2            __at(0x6C8A);	// @ (0xD91 * 8 + 2)
#define                                 PWM1PHL2_bit        _BIT_ACCESS(PWM1PHL,2)
// PWM1PHL<PWM1PHL3>
extern volatile __bit                   PWM1PHL3            __at(0x6C8B);	// @ (0xD91 * 8 + 3)
#define                                 PWM1PHL3_bit        _BIT_ACCESS(PWM1PHL,3)
// PWM1PHL<PWM1PHL4>
extern volatile __bit                   PWM1PHL4            __at(0x6C8C);	// @ (0xD91 * 8 + 4)
#define                                 PWM1PHL4_bit        _BIT_ACCESS(PWM1PHL,4)
// PWM1PHL<PWM1PHL5>
extern volatile __bit                   PWM1PHL5            __at(0x6C8D);	// @ (0xD91 * 8 + 5)
#define                                 PWM1PHL5_bit        _BIT_ACCESS(PWM1PHL,5)
// PWM1PHL<PWM1PHL6>
extern volatile __bit                   PWM1PHL6            __at(0x6C8E);	// @ (0xD91 * 8 + 6)
#define                                 PWM1PHL6_bit        _BIT_ACCESS(PWM1PHL,6)
// PWM1PHL<PWM1PHL7>
extern volatile __bit                   PWM1PHL7            __at(0x6C8F);	// @ (0xD91 * 8 + 7)
#define                                 PWM1PHL7_bit        _BIT_ACCESS(PWM1PHL,7)
// PWM1CON<PWM1POL>
extern volatile __bit                   PWM1POL             __at(0x6CDC);	// @ (0xD9B * 8 + 4)
#define                                 PWM1POL_bit         _BIT_ACCESS(PWM1CON,4)
// PWM1PRH<PWM1PRH0>
extern volatile __bit                   PWM1PRH0            __at(0x6CB0);	// @ (0xD96 * 8 + 0)
#define                                 PWM1PRH0_bit        _BIT_ACCESS(PWM1PRH,0)
// PWM1PRH<PWM1PRH1>
extern volatile __bit                   PWM1PRH1            __at(0x6CB1);	// @ (0xD96 * 8 + 1)
#define                                 PWM1PRH1_bit        _BIT_ACCESS(PWM1PRH,1)
// PWM1PRH<PWM1PRH2>
extern volatile __bit                   PWM1PRH2            __at(0x6CB2);	// @ (0xD96 * 8 + 2)
#define                                 PWM1PRH2_bit        _BIT_ACCESS(PWM1PRH,2)
// PWM1PRH<PWM1PRH3>
extern volatile __bit                   PWM1PRH3            __at(0x6CB3);	// @ (0xD96 * 8 + 3)
